### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-prod-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-0b22d749517d906e0"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-0b22d749517d906e0" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
        name                  = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-11-29T15:23:44Z" -> "2023-12-06T19:15:39Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-prod-api-ECSTask-2023030302392200850000000a"
        name                  = "gost-prod-api-ECSTask-2023030302392200850000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-11-29T14:53:42Z" -> "2023-12-06T19:25:30Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.api.module.arpa_audit_reports_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-api"
            "Name"       = "gost-prod-arpaauditreports-729134339726-us-west-2-api"
            "Namespace"  = "gost-prod"
        }
        # (11 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "rule-1"
            tags                                   = {}
            # (2 unchanged attributes hidden)

+           noncurrent_version_expiration {
+               days = 7
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.website.module.logs_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-logs-729134339726-us-west-2-website"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-website"
            "Name"       = "gost-prod-logs-729134339726-us-west-2-website"
            "Namespace"  = "gost-prod"
        }
        # (11 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "rule-1"
            tags                                   = {}
            # (2 unchanged attributes hidden)

+           noncurrent_version_expiration {
+               days = 90
            }

+           noncurrent_version_transition {
+               days          = 30
+               storage_class = "GLACIER"
            }

            # (3 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.website.module.origin_bucket.aws_s3_bucket.default[0] has changed
  ~ resource "aws_s3_bucket" "default" {
        id                          = "gost-prod-origin-729134339726-us-west-2-website"
        tags                        = {
            "Attributes" = "729134339726-us-west-2-website"
            "Name"       = "gost-prod-origin-729134339726-us-west-2-website"
            "Namespace"  = "gost-prod"
        }
        # (11 unchanged attributes hidden)

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = 1
+           enabled                                = true
+           id                                     = "rule-1"
+           tags                                   = {}

+           noncurrent_version_expiration {
+               days = 7
            }
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-api"
        name                               = "gost-prod-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:25" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "4bd8d3b55a9cb6248c2f2c151c4276194089f0fc" -> "9d41243bada018fc1d4d25775269a16c9fe7e0fc"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (7 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "4bd8d3b55a9cb6248c2f2c151c4276194089f0fc" -> "9d41243bada018fc1d4d25775269a16c9fe7e0fc"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "false"
                        },
                        # (10 unchanged elements hidden)
                    ]
                    name                   = "api"
-                   volumesFrom            = [] -> null
                    # (10 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "4bd8d3b55a9cb6248c2f2c151c4276194089f0fc" -> "9d41243bada018fc1d4d25775269a16c9fe7e0fc"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "4bd8d3b55a9cb6248c2f2c151c4276194089f0fc" -> "9d41243bada018fc1d4d25775269a16c9fe7e0fc"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
-                   mountPoints            = [] -> null
                    name                   = "datadog"
-                   portMappings           = [] -> null
-                   volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-prod-api" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-arpa_audit_report"
        name                               = "gost-prod-arpa_audit_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-arpa_audit_report:10" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-arpa_audit_report:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-arpa_audit_report" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-prod-arpa_audit_report" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 10 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_treasury_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-treasury_report"
        name                               = "gost-prod-treasury_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-treasury_report:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_treasury_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-treasury_report:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-treasury_report" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-prod-treasury_report" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 2 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-consume_grants"
        name                               = "gost-prod-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-consume_grants:19" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-consume_grants:19" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-prod-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 19 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: `Terraform CI`*